Revit 2024 API
ExternallyTaggedGeometryValidation.IsValidGeometry Method
 Validates the input geometry to be stored in an externally tagged geometry object. Valid types of geometry are: Solid, Mesh, GeometryInstance, Point and Curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a later version of Revit. We suggest using validation methods provided by the Element which uses this geometry where available. For example, DirectShape.IsValidShape for a DirectShape should be used for DirectShapes.")]
public static bool IsValidGeometry(
	GeometryObject geometry
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a later version of Revit. We suggest using validation methods provided by the Element which uses this geometry where available. For example, DirectShape.IsValidShape for a DirectShape should be used for DirectShapes.")> _
Public Shared Function IsValidGeometry ( _
	geometry As GeometryObject _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a later version of Revit. We suggest using validation methods provided by the Element which uses this geometry where available. For example, DirectShape.IsValidShape for a DirectShape should be used for DirectShapes.")]
public:
static bool IsValidGeometry(
	GeometryObject^ geometry
)
Parameters
geometry
Type: Autodesk.Revit.DB.GeometryObject
 Geometry object to be validated.
Return Value
 True if the supplied geometry object passes the validation criteria.
See Also
ExternallyTaggedGeometryValidation Class
Autodesk.Revit.DB Namespace